# "1st program"

print(9**0.5*5)

# "2nd program"

print(9.99>9.98 and 1000!=1001)                   # первое решение

print(9.99 > 9.98 or 1000 != 1001)                # второе решение

# "3rd program"

print((int(1234%1000/10)) + (int(5678%1000/10)))  # первое решение

print((1234%1000//10) + (5678%1000//10))          # второе решение

print(1234//(1234//23)+5678//(5678//67))          # третье решение

# "4th program"

print ((int(13.42*100%100) == (int(42.13))) or (int(13.42)) == (int(42.13*100%100)))

# в первой половинке выражения я проверил число 42
# во второй половинке проверил число 13
# если я правильно понял задачу , то код будет такой, надеюсь верно.

